wtcat/platform/embeded/rtems/bsps/arm/stm32h750-art-pi/stm32h7_sdram.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-12-04     zylx         first version
 */
#include <errno.h>
#include <rtems/bspIo.h>

#include "base/compiler.h"

#include "stm32/stm32_sdram.h"
#include "stm32h7xx_hal.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_gpio.h"


static void __notrace SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram, 
    FMC_SDRAM_CommandTypeDef *Command) {
    __IO uint32_t tmpmrd = 0;
    uint32_t target_bank = 0;

#if SDRAM_TARGET_BANK == 1
    target_bank = FMC_SDRAM_CMD_TARGET_BANK1;
#else
    target_bank = FMC_SDRAM_CMD_TARGET_BANK2;
#endif
    /* Configure a clock configuration enable command */
    Command->CommandMode           = FMC_SDRAM_CMD_CLK_ENABLE;
    Command->CommandTarget         = target_bank;
    Command->AutoRefreshNumber     = 1;
    Command->ModeRegisterDefinition = 0;

    /* Send the command */
    HAL_SDRAM_SendCommand(hsdram, Command, 0x1000);

    /* Insert 100 ms delay */
    /* interrupt is not enable, just to delay some time. */
    for (tmpmrd = 0; tmpmrd < 0xffff; tmpmrd ++)
        ;

    /* Configure a PALL (precharge all) command */
    Command->CommandMode            = FMC_SDRAM_CMD_PALL;
    Command->CommandTarget          = target_bank;
    Command->AutoRefreshNumber      = 1;
    Command->ModeRegisterDefinition = 0;

    /* Send the command */
    HAL_SDRAM_SendCommand(hsdram, Command, 0x1000);

    /* Configure a Auto-Refresh command */
    Command->CommandMode            = FMC_SDRAM_CMD_AUTOREFRESH_MODE;
    Command->CommandTarget          = target_bank;
    Command->AutoRefreshNumber      = 8;
    Command->ModeRegisterDefinition = 0;

    /* Send the command */
    HAL_SDRAM_SendCommand(hsdram, Command, 0x1000);

    /* Program the external memory mode register */
#if SDRAM_DATA_WIDTH == 8
    tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1     |
#elif SDRAM_DATA_WIDTH == 16
    tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_2     |
#else
    tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_4     |
#endif
             SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL        |
#if SDRAM_CAS_LATENCY == 3
             SDRAM_MODEREG_CAS_LATENCY_3                |
#else
             SDRAM_MODEREG_CAS_LATENCY_2                |
#endif
             SDRAM_MODEREG_OPERATING_MODE_STANDARD      |
             SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;

    Command->CommandMode            = FMC_SDRAM_CMD_LOAD_MODE;
    Command->CommandTarget          = target_bank;
    Command->AutoRefreshNumber      = 1;
    Command->ModeRegisterDefinition = tmpmrd;

    /* Send the command */
    HAL_SDRAM_SendCommand(hsdram, Command, 0x1000);

    /* Set the device refresh counter */
    HAL_SDRAM_ProgramRefreshRate(hsdram, SDRAM_REFRESH_COUNT);
}

static int __notrace SDRAM_Init(void) {
    int result = 0;
    FMC_SDRAM_TimingTypeDef SDRAM_Timing;
    SDRAM_HandleTypeDef hsdram1;
    FMC_SDRAM_CommandTypeDef command;

    /* SDRAM device configuration */
    hsdram1.Instance = FMC_SDRAM_DEVICE;
    SDRAM_Timing.LoadToActiveDelay    = LOADTOACTIVEDELAY;
    SDRAM_Timing.ExitSelfRefreshDelay = EXITSELFREFRESHDELAY;
    SDRAM_Timing.SelfRefreshTime      = SELFREFRESHTIME;
    SDRAM_Timing.RowCycleDelay        = ROWCYCLEDELAY;
    SDRAM_Timing.WriteRecoveryTime    = WRITERECOVERYTIME;
    SDRAM_Timing.RPDelay              = RPDELAY;
    SDRAM_Timing.RCDDelay             = RCDDELAY;

#if SDRAM_TARGET_BANK == 1
    hsdram1.Init.SDBank             = FMC_SDRAM_BANK1;
#else
    hsdram1.Init.SDBank             = FMC_SDRAM_BANK2;
#endif
#if SDRAM_COLUMN_BITS == 8
    hsdram1.Init.ColumnBitsNumber   = FMC_SDRAM_COLUMN_BITS_NUM_8;
#elif SDRAM_COLUMN_BITS == 9
    hsdram1.Init.ColumnBitsNumber   = FMC_SDRAM_COLUMN_BITS_NUM_9;
#elif SDRAM_COLUMN_BITS == 10
    hsdram1.Init.ColumnBitsNumber   = FMC_SDRAM_COLUMN_BITS_NUM_10;
#else
    hsdram1.Init.ColumnBitsNumber   = FMC_SDRAM_COLUMN_BITS_NUM_11;
#endif
#if SDRAM_ROW_BITS == 11
    hsdram1.Init.RowBitsNumber      = FMC_SDRAM_ROW_BITS_NUM_11;
#elif SDRAM_ROW_BITS == 12
    hsdram1.Init.RowBitsNumber      = FMC_SDRAM_ROW_BITS_NUM_12;
#else
    hsdram1.Init.RowBitsNumber      = FMC_SDRAM_ROW_BITS_NUM_13;
#endif

#if SDRAM_DATA_WIDTH == 8
    hsdram1.Init.MemoryDataWidth    = FMC_SDRAM_MEM_BUS_WIDTH_8;
#elif SDRAM_DATA_WIDTH == 16
    hsdram1.Init.MemoryDataWidth    = FMC_SDRAM_MEM_BUS_WIDTH_16;
#else
    hsdram1.Init.MemoryDataWidth    = FMC_SDRAM_MEM_BUS_WIDTH_32;
#endif
    hsdram1.Init.InternalBankNumber = FMC_SDRAM_INTERN_BANKS_NUM_4;
#if SDRAM_CAS_LATENCY == 1
    hsdram1.Init.CASLatency         = FMC_SDRAM_CAS_LATENCY_1;
#elif SDRAM_CAS_LATENCY == 2
    hsdram1.Init.CASLatency         = FMC_SDRAM_CAS_LATENCY_2;
#else
    hsdram1.Init.CASLatency         = FMC_SDRAM_CAS_LATENCY_3;
#endif
    hsdram1.Init.WriteProtection    = FMC_SDRAM_WRITE_PROTECTION_DISABLE;
#if SDCLOCK_PERIOD == 2
    hsdram1.Init.SDClockPeriod      = FMC_SDRAM_CLOCK_PERIOD_2;
#else
    hsdram1.Init.SDClockPeriod      = FMC_SDRAM_CLOCK_PERIOD_3;
#endif
    hsdram1.Init.ReadBurst          = FMC_SDRAM_RBURST_ENABLE;
#if SDRAM_RPIPE_DELAY == 0
    hsdram1.Init.ReadPipeDelay      = FMC_SDRAM_RPIPE_DELAY_0;
#elif SDRAM_RPIPE_DELAY == 1
    hsdram1.Init.ReadPipeDelay      = FMC_SDRAM_RPIPE_DELAY_1;
#else
    hsdram1.Init.ReadPipeDelay      = FMC_SDRAM_RPIPE_DELAY_2;
#endif

    /* Enable the FMC interface clock */
    RCC->AHB3ENR |= RCC_AHB3ENR_FMCEN;

    /* Initialize the SDRAM controller */
    if (HAL_SDRAM_Init(&hsdram1, &SDRAM_Timing) != HAL_OK) {
        printk("SDRAM init failed!");
        result = -EIO;
    } else {
        /* Program the SDRAM external device */
        SDRAM_Initialization_Sequence(&hsdram1, &command);
        printk("sdram init success, mapped at 0x%X, size is %d bytes, data width is %d", 
            SDRAM_BANK_ADDR, SDRAM_SIZE, SDRAM_DATA_WIDTH);
    }
    return result;
}

static void __notrace stm32h7_sdram_setup_pin(GPIO_TypeDef *GPIOx, uint32_t Pin) {
    LL_GPIO_SetPinMode(GPIOx, Pin, LL_GPIO_MODE_ALTERNATE);
    LL_GPIO_SetPinOutputType(GPIOx, Pin, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetPinSpeed(GPIOx, Pin, LL_GPIO_SPEED_FREQ_VERY_HIGH);
    LL_GPIO_SetPinPull(GPIOx, Pin, LL_GPIO_PULL_UP);
    if (Pin < 8)
        LL_GPIO_SetAFPin_0_7(GPIOx, Pin, LL_GPIO_AF_12);
    else
        LL_GPIO_SetAFPin_8_15(GPIOx, Pin, LL_GPIO_AF_12);
}

static void __notrace stm32h7_sdram_setup_pins(void) {
    LL_AHB4_GRP1_EnableClock(
        LL_AHB4_GRP1_PERIPH_GPIOC | 
        LL_AHB4_GRP1_PERIPH_GPIOD |
        LL_AHB4_GRP1_PERIPH_GPIOE |
        LL_AHB4_GRP1_PERIPH_GPIOF |
        LL_AHB4_GRP1_PERIPH_GPIOG);

    /* GPIOC */
    stm32h7_sdram_setup_pin(GPIOC, LL_GPIO_PIN_2);
    stm32h7_sdram_setup_pin(GPIOC, LL_GPIO_PIN_3);

    /* GPIOD */
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_0);
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_1);
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_8);
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_9);
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_10);
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_14);
    stm32h7_sdram_setup_pin(GPIOD, LL_GPIO_PIN_15);

    /* GPIOE */
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_0);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_1);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_7);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_8);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_9);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_10);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_11);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_12);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_13);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_14);
    stm32h7_sdram_setup_pin(GPIOE, LL_GPIO_PIN_15);

    /* GPIOF */
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_0);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_1);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_2);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_3);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_4);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_5);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_11);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_12);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_13);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_14);
    stm32h7_sdram_setup_pin(GPIOF, LL_GPIO_PIN_15);

    /* GPIOG */
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_0);
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_1);
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_2);
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_4);
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_5);
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_8);
    stm32h7_sdram_setup_pin(GPIOG, LL_GPIO_PIN_15);

    /* GPIOH */
    stm32h7_sdram_setup_pin(GPIOH, LL_GPIO_PIN_5);
}

void __notrace stm32h7_sdram_init(void) {
    stm32h7_sdram_setup_pins();
    SDRAM_Init();
}


